//Завдання 3. Число називається досконалим, якщо сума всіх його дільників дорівнює йому самому.Напишіть функцію пошуку таких чисел у введеному інтервалі.
#include <iostream>
#include <Windows.h>// підключення заголовного файлу Windows.h, завдяки чому зможемо використовувати українську мову
using namespace std;
int result(int a, int b) {//оголошуємо функцію result та її аргументи a,b
    int numb = 0;//оголошуємо змінну numb, яка відповіає досконалому числу
    if (a < b) {//якщо  число b більше числа a
        for (int i = a; i <= b; i++) {//застосовуємо цикл для перевірки чисел в діапазоні a-b
            numb = 1;
            for (int j = 2; j < i; j++) //застосовуємо цикл для пошуку дільників числа i

                if (i % j == 0) {//умова при якій число j буде дільником числа i
                    numb += j;// число numb дорівнює сумі чисел дільників числа i

                }
            
            if(numb == i)//якщо число numb рівне i, то воно є досконалим
            {                
                cout << "Досконалим числом є число:  " << numb << ' ' << endl;//виводяться досконалі числа, так як виведення в циклі
                
               
            }

        }
    }
    if (a > b) {//якщо  число a більше числа b
        for (int i = b; i <= a; i++) {//застосовуємо цикл для перевірки чисел в діапазоні b-a
            numb = 1;
            for (int j = 2; j < i; j++) {//застосовуємо цикл для пошуку дільників числа i

                if (i % j == 0) {//умова при якій число j буде дільником числа i
                    numb += j;// число numb дорівнює сумі чисел дільників числа i

                }
            }
            if (numb == i)//якщо число numb рівне i, то воно є досконалим
            {
                cout << "Досконалим числом є число:  " << numb << ' ' << endl;//виводяться досконалі числа, так як виведення в циклі
                
            }

        }
    }
    return numb;//повернення numb
 }

int main()
{
    SetConsoleCP(1251); // встановлення кодування Windows-1251 в  потік введення
    SetConsoleOutputCP(1251); // встановлення кодування Windows-1251 в  потік виведення
    int a =0, b=0;//оголошуємо змінні a, b- введений інтервал
    cout << "Введіть  число  a" << endl;//введіть будь-яке число a
    cin >> a;
    cout << "Введіть  число  b" << endl;//введіть будь-яке число b
    cin >> b;
    
    result(a, b);//повертаємось до функції  result(a, b)
    
    
    return 0;
}
